Revit 2023 API
PathReinforcement.ConvertRebarInSystemToRebars Method
 Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2022
Syntax
C#
public static IList<ElementId> ConvertRebarInSystemToRebars(
	Document doc,
	PathReinforcement system
)
Visual Basic
Public Shared Function ConvertRebarInSystemToRebars ( _
	doc As Document, _
	system As PathReinforcement _
) As IList(Of ElementId)
Visual C++
public:
static IList<ElementId^>^ ConvertRebarInSystemToRebars(
	Document^ doc,
	PathReinforcement^ system
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 The document.
system
Type: Autodesk.Revit.DB.Structure.PathReinforcement
 A PathReinforcement element in the document.
Return Value
 The ids of the newly created Rebar elements.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The element system was not found in the given document. -or- system does not host Rebar.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace